load-tests/pre-singleton-engine.txt
All VUs finished. Total time: 1 minute, 44 seconds

--------------------------------
Summary report @ 12:40:36(-0500)
--------------------------------

errors.ETIMEDOUT: .............................................................. 2553
http.codes.200: ................................................................ 175
http.downloaded_bytes: ......................................................... 2580
http.request_rate: ............................................................. 30/sec
http.requests: ................................................................. 2725
http.response_time:
  min: ......................................................................... 8
  max: ......................................................................... 9903
  mean: ........................................................................ 3190.5
  median: ...................................................................... 2143.5
  p95: ......................................................................... 9230.4
  p99: ......................................................................... 9801.2
http.response_time.2xx:
  min: ......................................................................... 8
  max: ......................................................................... 9903
  mean: ........................................................................ 3190.5
  median: ...................................................................... 2143.5
  p95: ......................................................................... 9230.4
  p99: ......................................................................... 9801.2
http.responses: ................................................................ 175
plugins.expect.ok: ............................................................. 172
plugins.expect.ok.statusCode: .................................................. 172
vusers.completed: .............................................................. 172
vusers.created: ................................................................ 2725
vusers.created_by_name.Load Test: .............................................. 2725
vusers.failed: ................................................................. 2553
vusers.session_length:
  min: ......................................................................... 16.4
  max: ......................................................................... 10001.9
  mean: ........................................................................ 3274.6
  median: ...................................................................... 2276.1
  p95: ......................................................................... 9230.4
  p99: ......................................................................... 9416.8